{"data":{"site":{"siteMetadata":{"title":"La gaceta de la cabeza","author":"Joaquín Bravo Contreras"}},"markdownRemark":{"id":"023e3176-493b-5aaf-adca-1a6e9c916ce6","excerpt":"Llevo algún rato intentando rastrear de manera eficaz algunos módulos de drupal que están en desarrollo:  spaces  y  context…","html":"<p>Llevo algún rato intentando rastrear de manera eficaz algunos módulos de drupal que están en desarrollo: <a href=\"http://drupal.org/project/spaces\">spaces</a> y <a href=\"http://drupal.org/project/context\">context</a>.</p>\n<p>Lamentablemente, en drupal todavía usan CVS para administrar el código. El código que usan para administrar los projectos en drupal.org (releases, registro de bugs, descargas, etc) está basado en CVS, y aunque poco a poco avanzan para hacerlo más independiente de CVS y poder utilizar subversion o cualquier otra cosa, pues es algo que va a tomar todavía algo de tiempo.</p>\n<p>Así que la solución que más me agrada es seguir el avance de estos repositorios utilizando git ;-). <a href=\"http://mikkel.hoegh.org/blog/2008/a_git_mirror_for_drupal_cvs\">Este</a> blog te dice cómo hacerlo en inglés. Los pasos son simples. El comando de git-cvsimport actúa en la carpeta en la que estás ubicado a menos que utilices la opción de -C para decirle a qué carpeta quieres importar, así que crea una carpeta para tu repositorio antes de empezar.</p>\n<div class=\"gatsby-highlight\" data-language=\"$ mkdir spaces\">\n      <pre class=\"language-$ mkdir spaces\"><code class=\"language-$ mkdir spaces\">$ cd spaces\n$ git-cvsimport -d:pserver:anonymous@cvs.drupal.org:/cvs/drupal-contrib -k -v -r drupal-contrib contributions/modules/spaces```\n\n&lt;ul&gt;\n&lt;li&gt;La opción de -d indica donde esta el repositorio de CVS&lt;/li&gt;\n&lt;li&gt;la opción de -k es para evitar cambiar los keywords de CVS y es opcional aunque recomendada (al menos si ves el manpage de git-cvsimport)&lt;/li&gt;\n&lt;li&gt;-v para que te imprima lo que está haciendo (si no, funcionará como cualquier comando de UNIX que no imprime nada a menos que haya un error)&lt;/li&gt;\n&lt;li&gt;la opción de -r es para que utilice un nombre en tu repositorio de git diferente a origin para este repositorio remoto, puedes decidir no utilizarla&lt;/li&gt;\n&lt;li&gt;y finalmente le tienes que decir qué módulo de CVS quieres traerte&lt;/li&gt;\n&lt;/ul&gt;\n\nPara mantener actualizado este repositorio de git no hay más que correr este mismo comando en  la misma carpeta y lixto!</code></pre>\n      </div>","frontmatter":{"title":"CVS desde git, y como mantenerlos sincronizados","date":"July 24, 2008","tags":["git","drupal"]}}},"pageContext":{"slug":"/cvs-desde-git-y-como-mantenerlos-sincronizados/","previous":{"fields":{"slug":"/dell-vostro-1510-con-ubuntu/"},"frontmatter":{"title":"Dell vostro 1510 con ubuntu","aliases":["2008/07/22/dell-vostro-1510-con-ubuntu"],"tags":["ubuntu"]}},"next":{"fields":{"slug":"/backups-de-mysql-con-git/"},"frontmatter":{"title":"Backups de MySQL con git","aliases":["2008/08/05/backups-de-mysql-con-git"],"tags":["git","mysql"]}}}}