{"data":{"site":{"siteMetadata":{"siteUrl":"https://joaquin.axai.mx/","title":"La gaceta de la cabeza","author":"Joaquín Bravo Contreras","disqusShortname":"gaceta-de-la-cabeza"}},"markdownRemark":{"id":"ff1a25be-3b67-5d4d-89e5-69468f341e16","excerpt":"Como muchos programadores, soy un perfeccionista, y muuuuuchas veces, mientras estoy programando una nueva vista o cualquier tontería, me…","html":"<p>Como muchos programadores, soy un perfeccionista, y muuuuuchas veces, mientras estoy programando una nueva vista o cualquier tontería, me encuentro que estoy divagando con otras posibles soluciones, o revisando la arquitectura de la aplicación completa, o navegando en la wikipedia sobre esa nueva tecnología que tal vez podría ayudar en este o futuros proyectos, en lugar de estar programando la cosa que tengo que programar.</p>\n<p>El miedo hiere más que las espadas. Es una frase de “Game of Thrones” que Syrio Forel, dancarín del agua, le enseña a Arya Stark. Muchas veces nos paralizamos en hacer lo que tenemos que hacer, pensando que lo podríamos hacer mejor si tan sólo lo hicieramos con tal nueva tecnología, si tan sólo la arquitectura de la aplicación considerara tal o cuál cosa, si tan sólo no estuviera lloviendo afuera, si tan sólo.</p>\n<p>Hay veces que tenemos que recordarnos que el miedo hiere más que las espadas y más nos vale mejor ponernos a escupir código.</p>\n<p>El miedo hiere más que las arquitecturas endebles.<br>\nEl miedo hiere más que los correos con explicaciones cortas.<br>\nEl miedo hiere más que las tecnologías obsoletas.  </p>","fields":{"slug":"/el-miedo-hiere-mas-que-las-espadas/"},"frontmatter":{"title":"El miedo hiere más que las espadas","date":"August 26, 2011","tags":[]}}},"pageContext":{"slug":"/el-miedo-hiere-mas-que-las-espadas/","previous":{"fields":{"slug":"/usando-views-handlers-para-mostrar-el-total-de-una-vista-de-inventario/"},"frontmatter":{"title":"Usando views handlers para mostrar el total de una vista de inventario","aliases":["creando-views-handlers"],"tags":["drupal","views"]}},"next":{"fields":{"slug":"/debuguear-php-con-emacs-xdebug-y-geben/"},"frontmatter":{"title":"Debuguear php con emacs, xdebug y geben","aliases":[],"tags":["drupal","php"]}}}}