{"data":{"site":{"siteMetadata":{"title":"La gaceta de la cabeza","author":"Joaquín Bravo Contreras"}},"markdownRemark":{"id":"891ca1b3-2d83-5639-9dde-2328ac846875","excerpt":"Hace poco, por razones estríctamente laborales, decidí instalar el stack de desarrollo de Microsoft. Llamese Visual Studio 2008, SQL Server…","html":"<p>Hace poco, por razones estríctamente laborales, decidí instalar el stack de desarrollo de Microsoft. Llamese Visual Studio 2008, SQL Server 2008 Express y otras herramientas sugeridas por el <a href=\"http://microsoft.com/web\">web platform installer</a>.</p>\n<p>Debo decir que estoy gratamente sorprendido por el web platform installer. Ya que con él puedes instalar PHP de manera decente - usando FastCGI - para el IIS e incluso Drupal y otros programas de software libre.</p>\n<p>Aunque las herramientas de Microsoft son de primera clase - Visual Studio está muy chido, sobre todo usando emacs bindings para los shortcuts jeje - debo decir que el proceso de instalación dista mucho de ser algo sencillo. Es larguíiiiiismo y aparte siempre te encuentras con piedras en el camino.</p>\n<p>La más grande de todas llegó al querer instalar el SQL Server 2008 Express. La maldita cosa no quería instalarse. Primero creí que era cosa de dlls, porque tenía instalada la versión 2005 desde antes, tons la desinstalé. Nada. Como buen programador me puse a checar los logs de errores y por ahí salía el mensaje de error:</p>\n<blockquote>\n<p> Rule “Performance counter registry hive consistency check” failed. The performance counter registry hive is corrupted</p>\n</blockquote>\n<p>E incluso una referencia a la base de conocimientos de Microsoft para <a href=\"http://support.microsoft.com/kb/300956\">ver cómo solucionarlo</a>. ¡Vaya! Eso sí son mensajes de error. Los pasos no eran miel sobre hojuelas. Tenía que editar el registro de windows, borrar algunas entradas y luego correr algunos comandos en la consola para poder regenerarlos, reiniciar - ¡claro! - y luego correr otros comandos. Terminé muy satisfecho de la ayuda clara y me dispuse a instalar nuevamente. Nada.</p>\n<p>Chale. Bueno, pues vamos buscando en Google =D. <a href=\"http://www.ferventcoder.com/archive/2008/08/10/possible-performance-counter-corruption-or-performance-counters-are-just-disabled.aspx\">La primera respuesta</a> se veía bastante prometedora, porque era de alguien que tampoco había podido instalar el SQL Server. Lo malo fue que el leer ví que repetía algunos de los pasos que ya había seguido y que no aplicaba mucho a mi situación actual.</p>\n<p>Total que googleando por otros lados eventualmente llegué a una página titulada ”<a href=\"https://connect.microsoft.com/SQLServer/feedback/ViewFeedback.aspx?FeedbackID=311246\">SQL Server 2008 Nov CTP Installation error</a>”. Y ahí encontré la solución a mi problema. Otra persona se dió a la tarea de:</p>\n<ul>\n<li>leyendo el mismo log de errores</li>\n<li>encontrar la clase desde donde fue lanzada el error (Microsoft.SqlServer.Configuration.SetupExtension.FacetPerfMonCheck)</li>\n<li>decompilar el dll que la contiene (\\Program Files\\Microsoft SQL Server\\100\\Setup Bootstrap\\ Microsoft.SqlServer.Configuration.SetupExtension.dll)</li>\n<li>y en la función referida ver que la segunda línea pide un LCID (Locale ID asignado por Microsoft)</li>\n</ul>\n<p>Esta función regresaba el valor 7C04 que debía ser encontrado en una llave del registro, pero que no existía, existían otros. Así que creó la llave, copió los registros que estaban en la llave equivalente y logró instalar el programa. Mi heroe =D.</p>\n<p>Ahora sólo tenía que encontrar cuál era el LCID de mi máquina. Así viendo la misma línea de código que él creé mi primer programa en C# usando mi recién instalado Visual Studio (también lo corrí en MonoDevelop nomás pa comparar):</p>\n<div class=\"gatsby-highlight\" data-language=\"text\">\n      <pre class=\"language-text\"><code class=\"language-text\">using System.Globalization;\n\nnamespace ConsoleTest\n{\n    class MainClass\n    {\n        public static void Main (string[] args)\n        {\n            string LCID = CultureInfo.InstalledUICulture.Parent.LCID.ToString(&quot;X&quot;);\n            string str2 = string.Format(&quot;{0,3}&quot;, LCID).Replace(&quot; &quot;, &quot;0&quot;);\n            Console.WriteLine(str2);\n            Console.ReadLine();\n        }\n    }\n}</code></pre>\n      </div>\n<p>Creé el registro y ¡presto! se instaló el SQL Server.</p>\n<p>Que rollo. Total, ya tengo todo lo necesario pa programar aplicaciones usando el Visual Studio y todo usando nada más como 2GB =P. Mi stack en linux es de como 100 MB (contando IDE, servidor web y servidor SQL). Codeen a gusto!</p>","frontmatter":{"title":"Dolores de cabeza instalando el stack de microsoft","date":"September 22, 2009"}}},"pageContext":{"slug":"/dolores-de-cabeza-instalando-el-stack-de-microsoft/","previous":{"fields":{"slug":"/se-busca-programador/"},"frontmatter":{"title":"Se busca programador","aliases":[],"tags":["axai"]}},"next":{"fields":{"slug":"/url-shorteners-y-estadisticas-de-visitas/"},"frontmatter":{"title":"URL shorteners y estadísticas de visitas","aliases":[],"tags":[]}}}}