{"data":{"site":{"siteMetadata":{"title":"La gaceta de la cabeza","author":"Joaquín Bravo Contreras"}},"markdownRemark":{"id":"55a30d37-be31-5cb9-9ab5-8b46c79a9676","excerpt":"Hace poco vi la película de Life of Pi. Y la verdad me gustó mucho. Primero, porque el personaje es hindú, cristiano y musulmán. Creo que…","html":"<p>Hace poco vi la película de Life of Pi. Y la verdad me gustó mucho. Primero, porque el personaje es hindú, cristiano y musulmán. Creo que todos deberíamos ser más tolerantes con todas las religiones, y más aún, entender que todas hablan de lo mismo, son diferentes maneras de entender el mundo y a Dios y todas guardan algo de verdad. Me da gusto ver una película que también propone esto a más gente.</p>\n<p>Sobre el asunto de la religión, para mi es muy significativa la parte final:</p>\n<div class=\"gatsby-highlight\" data-language=\"text\">\n      <pre class=\"language-text\"><code class=\"language-text\">- cuál historia te gustó más?\n- la primera\n- y lo mismo sucede con la religión</code></pre>\n      </div>\n<p>Mi opinión es que el personaje tenía dos maneras de interpretar la misma historia. La segunda historia que cuentan en la película es la historia cruda, sin moral ni enseñanza, la vida tal cual es. La primera, era su interpretación a la luz de sus creencias, de la enseñanza que había sacado del hecho trágico de estar en un naufragio y perder a toda su familia. El darle una interpretación no hace a la segunda falsa o que nosotros queramos ocultarla u olvidarla (aunque a veces sí pasa así con la religión, olvidamos también). Pero tampoco la primera es una historia inventada de ciencia ficción que jamás sucedió. Es una interpretación, es una manera de ver la vida. Ambas son verdaderas.</p>\n<p>Lo mismo sucede con la religión. Es nuestra interpretación de la vida. Pero es importante conocer ambas partes, reconocer nuestra interpretación religiosa y también la historia del mundo, saber la diferencia, pero no enterrar una por darle valor sólo a la otra. Y hoy en día estamos en medio de un doloroso proceso de combinar ambas partes, pero es un proceso que acaba de empezar hace menos de 100 años. La evolución, los nuevos estudios históricos sobre Jesús y la Biblia y muchas otras ondas “nuevas” (tienen como 50 años algunas, pero apenas nos vamos enterando muchos), son nuestra manera de descubrir lo que realmente pasó, pero como siempre habíamos creído que la primera historia era la única y verdadera a algunos nos da entonces por tacharla como un error completamente y a otros por negar los avances de la ciencia.</p>","frontmatter":{"title":"Una aventura extraordinaria (Life of Pi)","date":"March 12, 2013"}}},"pageContext":{"slug":"/una-aventura-extraordinaria-life-of-pi/","previous":{"fields":{"slug":"/demostracion-de-vim-para-edicion-rapida-de-archivos-/"},"frontmatter":{"title":"Demostración de VIM para edición rápida de archivos "}},"next":{"fields":{"slug":"/instalando-ledgersmb-en-ubuntu-1204-lts/"},"frontmatter":{"title":"Instalando LedgerSMB en ubuntu 12.04 LTS"}}}}