{"data":{"site":{"siteMetadata":{"title":"La gaceta de la cabeza","author":"Joaquín Bravo Contreras"}},"markdownRemark":{"id":"2de9efa3-2f61-5849-b9b0-b1ba85da8ed4","excerpt":"¿Qué es la fe?  La fe muchas veces es tomada como sinónimo de esperanza o convicción, normalmente en alguien, particularmente en Dios. Una…","html":"<p><strong>¿Qué es la fe?</strong> La fe muchas veces es tomada como sinónimo de esperanza o convicción, normalmente en alguien, particularmente en Dios. Una de las definiciones que me parecen más desafortunadas es la de “creer en algo aunque no tengas pruebas.” Acepto creer en algo aunque no lo veas, pero ¿sin tener pruebas?</p>\n<p>Creo que la fe es la confianza en aquello que ya has experimentado. En debates seguido se utiliza el ejemplo de la persona que tiene fe en que su esposa lo quiere. Esta fe o confianza viene de la experiencia, la persona conoce a su esposa, lo mismo debería pasar con otros tipos de fe. Que fuera sustentada en base a experiencias. Así entonces, para tener una buena fe, la tendrías que ponerla a prueba, criticarla, hacerle experimentos, para desechar aquello que no compagina con tus experiencias y reafirmar aquello que sí. Así también es doblemente cierto el dicho de que la fe sin obras está muerta (Santiago 2:14-19), porque para tener fe tendrías que obrar.</p>\n<p>Otra cita que viene al caso es la de Marcos 16:1-8. Es la conclusión del evangelio de Marcos, y el chiste es que no concluye con ninguna aparición de Jesús resucitado (después se le agregaron algunas como un “apéndice canónico”), sino que concluye simplemente con que “Él va delante de ustedes a Galilea. Allí lo verán, tal como les dijo.” Te pueden decir mil historias de Jesús resucitado, pero hasta que no sigas sus pasos, no imites su vida, no seas su discípulo, no lo experimentarás.</p>\n<p>Esto nos asusta un poco, porque luego, estamos aceptando que inicialmente podríamos tener fe en cosas que no son ciertas, y nos hace falta comprobarlas. Creo que este es el caso. Muchas veces creemos cosas que no tienen ningún fundamento.</p>\n<p>Por eso tampoco me gustan mucho textos como el Youcat. Por su tono definitivo. Ahí te dicen que cosas están bien y que cosas están mal. Ya no necesitas razonar nada por ti mismo. O de actividades para reafirmar la fe en donde repasamos el credo. Creemos que explicando el credo, de donde proviene y cómo se formo, ya reafirmamos nuestra fe. Cuando en realidad simplemente informamos, pero el juicio final de si realmente creo todo aquello que se dice en él es cierto o no sigue sin realizarse. No hemos razonado, probado o experimentado nada. Decimos cada domingo que creemos en la Santa Iglesia Católica, cuando en realidad todos sabemos que no es santa, y lo justificamos diciendo que en realidad solo está en camino de la santidad.</p>\n<p>La fe es tu teoría de vida, como crees que funciona el mundo y tu relación con él. Necesitas experimentar para ver si tu teoría es correcta o si necesitas formular nuevas teorías.</p>\n<p>La fe debe ser razonable, si no, se convierte en superstición.</p>","frontmatter":{"title":"Sobre la fe","date":"January 27, 2013"}}},"pageContext":{"slug":"/sobre-la-fe/","previous":null,"next":{"fields":{"slug":"/una-aventura-extraordinaria-life-of-pi/"},"frontmatter":{"title":"Una aventura extraordinaria (Life of Pi)"}}}}