{"data":{"site":{"siteMetadata":{"siteUrl":"https://joaquin.axai.mx/","title":"La gaceta de la cabeza","author":"Joaquín Bravo Contreras","disqusShortname":"gaceta-de-la-cabeza"}},"markdownRemark":{"id":"ba74892b-3ed1-526b-9e59-d8a0572afaac","excerpt":"Este domingo 6 de abril habrá aquí en Guadalajara el primer DevHouse. Este es un evento organizado a partir de los  SuperHappyDevHouse  que…","html":"<p>Este domingo 6 de abril habrá aquí en Guadalajara el primer DevHouse. Este es un evento organizado a partir de los <a href=\"http://superhappydevhouse.org/\">SuperHappyDevHouse</a> que son eventos organizados donde muchos desarrolladores, diseñadores y whatnot se junta para trabajar en proyectos, aprender y en general conocer gente interesada en tecnología.</p>\n<p>La invitación está abierta si quieres participar. La página del evento en guadalajara está <a href=\"http://guadalajaradevhouse.org/\">aquí</a>. No necesitas llevar nada más que dinero pa la comida y una laptop. Igual la dirección con mapa está ahí en la página.</p>\n<p>Últimamente he visto mucha actividad tecnológica aquí en GDL. Tal vez porque con Twitter y demás cosas de la Internet siento que todos estamos conectados =P jeje. Pero para muestra basta un botón. También por ahí está la gente de <a href=\"http://www.tequilavalley.com/\">TequilaValley</a> que ya ha organizado reuniones aquí en Guadalajara, la <a href=\"http://blogs.ligasilverlight.com/\">Liga Silverlight</a> y nosotros también hemos invitado al <a href=\"http://groups.drupal.org/node/24337\">primer Drupal Meetup</a> aquí en nuestra ciudad.</p>\n<p>Keep’em comming ;-)</p>","fields":{"slug":"/guadalajara-devhouse-y-otros-eventos-tecnologicos-en-la-ciudad/"},"frontmatter":{"title":"Guadalajara DevHouse y otros eventos tecnológicos en la ciudad","date":"September 04, 2009","tags":["programacion"]}}},"pageContext":{"slug":"/guadalajara-devhouse-y-otros-eventos-tecnologicos-en-la-ciudad/","previous":{"fields":{"slug":"/usando-la-consola-cuanto-miden-tus-particiones-y-carpetas/"},"frontmatter":{"title":"Usando la consola: Cuanto miden tus particiones y carpetas?","aliases":[],"tags":["linux","ubuntu","consola","shell"]}},"next":{"fields":{"slug":"/se-busca-programador/"},"frontmatter":{"title":"Se busca programador","aliases":[],"tags":["axai"]}}}}