{"data":{"site":{"siteMetadata":{"title":"La gaceta de la cabeza","author":"Joaquín Bravo Contreras"}},"markdownRemark":{"id":"3683223e-be35-5c77-8bf3-b5b7be687688","excerpt":"Me robaron mi bicicleta hace unas cuantas semanas, de hecho hace algunos meses ya. Es muy triste porque realmente me gustaba poder venirme…","html":"<p><a href=\"http://www.flickr.com/photos/jackbravo/2430407912/\" title=\"RIP bici by jackbravo, on Flickr\"><img src=\"http://farm4.static.flickr.com/3164/2430407912_298ee04536.jpg\" width=\"500\" height=\"334\" alt=\"RIP bici\"></a></p>\n<p>Me robaron mi bicicleta hace unas cuantas semanas, de hecho hace algunos meses ya. Es muy triste porque realmente me gustaba poder venirme en bici a la oficina, ahorita no hago mucho ejercicio que digamos.</p>\n<p>Normalmente metía la bicicleta a un patio que tenemos en el departamento (estamos en el primer piso ;-), pero ese día la dejé afuera de la oficina. Ya la había dejado ahí otras veces, y no me preocupaba demasiado porque para entrar a los departamentos hay una reja que normalmente esta cerrada, pero no siempre. Y al parecer, ocurrió lo que dice ese viejo adagio: <em>la ocasión hace al ladrón</em>. Y alguna persona que pasó por ahí, vio la bicicleta sin cadena, la reja abierta, y lo demás es historia…</p>\n<p>No creo que este sea motivo para que mi confianza en la humanidad se vea disminuida, sino más bien un fuerte recordatorio de que los tiempos que vivimos son muy gachos, y la mucha gente siente que tiene que aprovechar cualquier oportunidad que se le presente (sea esta buena o mala). ¿O al final será que ambas cosas son lo mismo?</p>\n<!--break-->","frontmatter":{"title":"Me robaron mi bicicleta","date":"December 03, 2008"}}},"pageContext":{"slug":"/me-robaron-mi-bicicleta/","previous":{"fields":{"slug":"/free-geek/"},"frontmatter":{"title":"Free Geek","aliases":[],"tags":["linux"]}},"next":{"fields":{"slug":"/usando-wget-para-bajar-canciones-o-imagenes/"},"frontmatter":{"title":"Usando wget para bajar canciones o imágenes","aliases":[],"tags":["linux","consola"]}}}}