{"data":{"site":{"siteMetadata":{"title":"La gaceta de la cabeza","author":"Joaquín Bravo Contreras"}},"markdownRemark":{"id":"e476e48a-9876-5f33-8e6f-af239dc42697","excerpt":"Cuando a uno le gusta el software libre siempre se buscan maneras de lograr negocios que funcionen de esa manera. Negocios abiertos como el…","html":"<p>Cuando a uno le gusta el software libre siempre se buscan maneras de lograr negocios que funcionen de esa manera. Negocios abiertos como el software que producen. Que le den más importancia a las personas que a la empresa, donde sea divertido trabajar, donde cada quién asuma sus propias responsabilidades y se interesen por hacer que el negocio prospere, que sean más horizontales y que produzcan riqueza para sus miembros, para la comunidad en la que están y para el mundo (en forma de más software libre ;-).</p>\n<p>En esa búsqueda me encontré por ahí el <a href=\"http://askmonty.org/wiki/index.php/The_hacking_business_model\">Hacking Business Model</a> publicado por <a href=\"http://monty-says.blogspot.com/\">Monty</a> el creador de MySQL. Me pareció sumamente interesante y una buena fuente de inspiración.</p>\n<p>Aquí pongo el contenido traducido al español para el que le interese y por referencia. Ese tipo de cosas siento que se leen mejor en el idioma natural (el software en cambio siempre se lee mejor en inglés).</p>\n<p>Hacking Business Model…</p>\n<!--break-->\n<h1>Propósito principios y métodos</h1>\n<p>Tomado de <a href=\"http://askmonty.org/wiki/index.php/The_hacking_business_model\">Ask Monty</a>.</p>\n<h2>Propósito</h2>\n<ul>\n<li>Crear un modelo de negocios sostenible que pueda ser adoptado y adaptado por otros.</li>\n<li>Crear una compañía justa y democrática, dirigida por sus miembros.</li>\n<li>Tener una relación confiable y significativa, de largo plazo con miembros y cientes.</li>\n</ul>\n<h2>Principios</h2>\n<ul>\n<li><strong>Igualitario</strong>: La creencia de que todas las personas deben ser tratadas por igual. Sin excluir ni discriminar a nadie.</li>\n<li><strong>Sostenible</strong>: Tenemos una visión de largo plazo en nuestro negocio. Vigilamos nuestras ganancias y gastamos con prudencia, cuidamos el uno del otro, cuidamos las cosas de las que dependemos.</li>\n<li><strong>Transparente</strong>: Nos comunicamos de una manera honesta y genuina. Cualquier información o proceso que pueda ser abierto, será abierto.</li>\n<li><strong>Divertido</strong>: Crear un lugar de trabajo en donde la gente pueda divertirse y quiera trabajar.</li>\n<li><strong>Ágil</strong>: Ser flexible, receptivo y adaptable, especialmente cuando se trata con personal y clientes.</li>\n</ul>\n<h2>Métodos</h2>\n<p>Herramientas concretas para ayudarnos a vivir de acuerdo a nuestros principios, incluyendo:</p>\n<ul>\n<li>Toma de decisiones basada en consenso.</li>\n<li>Transparencia corporativa - cualquier información o proceso que pueda ser abierto, deberá ser abierto.</li>\n<li>Licenciamiento que ayude a beneficiar a nuestra empresa, nuestro personal, nuestros clientes, nuestros socios y a la sociedad en general.</li>\n<li>Hacer partícipes de los beneficios al personal, colaboradores y otras causas valiosas.</li>\n<li>No intentar cambiar a la gente. Enfocarse en sacar los mejor de sus fortalezas. Encontrar caminos que no tropiecen con sus debilidades.</li>\n<li>Preferencia por trabajar con personas que comparten nuestros valores.</li>\n<li>Trabajar en contra de las patentes y otras legislaciones que dañan los derechos individuales.</li>\n</ul>\n<h1>Reglamento laboral</h1>\n<p>Algunos roles pueden tener requerimientos diferentes - como por ejemplo, alguien trabajando en soporte puede necesitar un horario regular. Por supuesto, cualquier diferencia debe señalarse explícitamente en el contrato en una sección que detalle las diferencias contra un acuerdo regular.</p>\n<ul>\n<li>El empleado trabaja en una empresa distribuida geográficamente y puede trabajar de donde sea.</li>\n<li>75 horas de trabajo cada dos semanas. Idealmente, el empleado debería trabajar en horarios que son amables para él y para otros.</li>\n<li>Vacaciones; todo mundo tiene 25 días libres al año más sábados y domingos. Esto significa debes usar uno de esos días libres si quieres descansar un día entre semana, aunque sea un día feriado en México. Hasta 25 días libres pueden pasar de un año a otro.</li>\n<li>Dinero por salir de vacaciones. Si usas más de 3 semanas de tus días libres obtienes medio mes de salario extra. Si no sales de vacaciones el dinero se paga al final del año bajo el plan de bono “consiguete una vida”.</li>\n<li>El empleado obtiene “copyright compartido” para todo código o documentación que produzca. Esto no incluye código o documentación especial en donde el cliente o alguna otra razón requieran la propiedad completa del código o la documentación.</li>\n<li>Regla del 80 / 20. Se alienta a los empleados a dedicar 20% de su tiempo a algún proyecto de su elección fuera de sus responsabilidades diarias.</li>\n<li>Los empleados necesitan ser transparentes con todo lo que hagan. La transparencia los hace responsables ante sus compañeros y ante sí mismos. También es el mejor vehículo para generar confianza.</li>\n<li>El empleado necesita hacer un reporte semanal que incluya todo lo que ha hecho durante la semana resaltando el progreso que tenga en sus principales actividades, sus planes para la siguiente semana y cualquier idea que tenga que quisiera discutir con otros.</li>\n<li>Los empleados DEBEN hablar si creen que la empresa está haciendo algo dañino para sí misma, sus empleados o sus clientes. Es clave para el éxito de la empresa que los empleados compartan la visión de la empresa. La grilla está estrictamente prohibida.</li>\n<li>Cada empleado debe contar con equipo cómodo (laptop, silla, monitor, etc).</li>\n<li>El equipo pasará a ser propiedad del usuario después de 5 años.</li>\n<li>El salario debe de ser competitivo en el área donde la persona trabaja. El plan de bonos es independiente a la geografía.</li>\n<li>Si un empleado ha sido de gran ayuda para conseguir / entregar el pedido de un cliente, tienen derecho a una bonificación por este trabajo. Todos los involucrados en una venta compartirán el 5% del “costo proporcional a la venta” (en proporción a su participación) y todos los involucrados en la entrega a compartir otro 5%. Sin embargo, todos estos bonos se deducirá de su parte de la bonificación de fin de año (siempre que la empresa sea rentable).</li>\n<li>A cada empleado se le asignará un número de prioridad de 1 a 10 (10 siendo el mejor) que describa su importancia para la empresa. El número será usado para calcular el bono de fin de año y acciones a recibir. El número de prioridad es acordado cuando el empleado se une a la empresa y es revisado cada año por su líder. El empleado recibirá lineamientos de lo que puede hacer para aumentar su prioridad en la empresa.</li>\n<li>El empleado debe ser capaz de comunicarse fluentemente en inglés. De ser necesario, la empresa patrocinará un curso de Inglés para aquellos que quieran mejorar sus habilidades de inglés.</li>\n<li>\n<p>Se espera que el empleado sea rentable. Esto significa que prefieran:</p>\n<ul>\n<li>Herramientas rentables como Skype en vez de llamadas de larga distancia</li>\n<li>Viajar en clase económica en vez de ejecutiva</li>\n<li>Hoteles de 3 estrellas, carros compactos y restaurantes de cocina económica</li>\n<li>Al viajar, deben esforzarse por quedarse en casa de algún conocido o compartir cuarto de hotel con otro compañero</li>\n</ul>\n</li>\n<li>Al ser contratados, se considera al empleado como “a prueba” durante los primeros 3 meses. Después del periodo de prueba, la empresa y el empleado podrán decidir si las cosas van bien y firmar un contrato de tiempo completo.</li>\n<li>Las personas que no se estén desempeñando de acuerdo a las expectativas recibirán una advertencia. Si la situación no se corrige en un mes se moverán a un estado de prueba. Después de 3 meses, la empresa y el empleado revisarán el desempeño y decidirán si seguir la relación laboral es lo mejor para ambas partes.</li>\n<li>Cuando un empleado se va, pueden comprar cualquier equipo de la empresa como indemnización. El precio se reducirá en 1/5 por año.</li>\n</ul>\n<h1>Reglamento de la empresa</h1>\n<ul>\n<li>El propósito principal de la empresa es generar dividendos para sus empleados (no ser vendida).</li>\n<li>La empresa debe procurar buscar hacer el trabajo lo más retador y divertido posible.</li>\n<li>La empresa será un entidad distribuida y buscará permanecer pequeña y eficiente. Si creciera demasiado buscaría separarse en unidades de negocio o empresas.</li>\n<li>Luchas por relaciones a largo plazo con empleados y clientes. La compañía es como una familia.</li>\n<li>La compañía debe respetar la individualidad de sus empleados. Si el empleado tiene demandas razonables necesitan ser tomadas a consideración seriamente. Por ejemplo cuando se habla de trabajar en fines de semana, compartir cuarto, renuencia a viajar, etc.</li>\n<li>La empresa empleará a las personas basada en sus méritos. No se discriminará por ningún motivo, sea género, religión, ubicación, estado civil o pareja sentimental.</li>\n<li>La empresa no requerirá trabajar fines de semana. La empresa puede pedir trabajar en fin de semana, pero el empleado puede rechazar la solicitud sin temer ninguna consecuencia.</li>\n<li>La empresa debe alentar a sus empleados para que tomen sus vacaciones y no las guarden para después. Esto es especialmente importante para aquellos empleados que están trabajando de más.</li>\n<li>Para proyectos de tiempo crítico, altamente remunerados y rentables que requieran horas extras la empresa pagará tres veces el salario y/o ofrecerá días de vacaciones pagadas.</li>\n<li>La compañía permitirá a los empleados, en la medida de lo posible, escoger su propio trabajo, en vez de decirles que hacer. Al escoger su propio trabajo es más probable que valores tu trabajo y te diviertas. Al escoger tu propias metas, es más probable que las cumplas. Al trabajar en equipo, se espera que la dirección sea llevada por un líder de proyecto, pero una vez terminado el proyecto, el empleado podrá decidir a qué otro proyecto dedicarse.</li>\n<li>La empresa necesita ser eficiente en el largo plazo y en la operación diaria. Esto debe ser considerado al escoger software, uso del teléfono, equipamiento, etc…</li>\n<li>La empresa no debe censurar las opiniones de sus empleados o impedir que las expresen. La empresa debe proveer los foros apropiados para que los empleados discutan cualquier tema relacionado con el trabajo.</li>\n<li>La empresa debe presupuestar al menos 3 viajes por empleado para asegurar que las personas trabajen eficientemente y se conozcan. Uno de los viajes debe ser para una junta de toda la empresa.</li>\n<li>\n<p>La empresa debe reconocer la importancia de la pareja/familia en un ambiente distribuido y seguir los siguientes lineamientos:</p>\n<ul>\n<li>Se alienta a la pareja a ir a las juntas de la empresa. La empresa pagará la mitad del viaje de la pareja y permitirá que el empleado comparta habitación con su pareja (sin costo extra para el empleado).</li>\n<li>Se invitará a la pareja a hasta 4 cenas por año (si se reúne a los empleados para cenar).</li>\n<li>En la regla anterior, otro miembro de la familia puede sustituir a la pareja.</li>\n</ul>\n</li>\n<li>La empresa debe ayudar y patrocinar proyectos de software libre (ver plan de bonos).</li>\n<li>La empresa debe esforzarse por tener lo más que pueda de sus planes e información disponibles públicamente. Y las reglas de la empresa se harán públicas en la página web.</li>\n<li>La empresa respetará la privacidad de sus empleados. No leerá, sin el consentimiento de el autor o el destinatario, ningún correo que no sea enviado a una lista de correo y no leerá logs de las sesiones privadas de IRC.</li>\n<li>Todo software producido por la empresa debe ser de código abierto (con la excepción de proyectos clasificados de los clientes). A ganancias iguales, la empresa preferirá hacer proyectos de código abierto.</li>\n</ul>\n<h1>Bonos</h1>\n<p>Al final del año las ganancias se distribuirán de la siguiente manera:</p>\n<ul>\n<li>45% será guardado para expansión</li>\n<li>5% será donado a proyectos de software libre. Los proyectos serán escogidos por los empleados por votación.</li>\n<li>5% será usado para apoyar ONGs. Los Los proyectos serán escogidos por los empleados por votación.</li>\n<li>20% máximo será usado para pagar deudas.</li>\n<li>20-45% (dependiendo de las deudas pagadas) será utilizado en bonos a empleados e inversionistas basado en los números de prioridad y las horas trabajadas.</li>\n</ul>\n<p>Los bonos de cada empleado se calculan de la siguiente manera:</p>\n<div class=\"gatsby-highlight\" data-language=\"text\">\n      <pre class=\"language-text\"><code class=\"language-text\">ganancia_horas_empleado = horas_trabajadas * prioridad\nbono = ganancia / SUM(todas ganancia_horas_empleado) * ganancia_horas_empleado</code></pre>\n      </div>\n<p>Un inversionista que ha invertido $1,000,000 es tratado como un empleado con nivel 5 de prioridad que ha trabajado 37.5 horas por semana durante 47 semanas. Y el inversionista debe esperar ganar por lo menos 8% de los bonos disponibles. Si recibe menos, el dinero faltante será añadido a su préstamo.</p>\n<p>Al final del año la empresa distribuirá 100,000 ‘semi-acciones’ a sus empleados e inversionistas activos, en proporción a la ‘ganancia<em>horas</em>empleado’. Estas acciones no tienen otro derecho más que en caso de que la empresa sea vendida entonces el dinero pagado por la empresa (menos costos, inversiones, prestamos, etc) será distribuido entre los propietarios de las semi-acciones.</p>\n<p>Al final del año la empresa debe buscar pagar (a una parte de) sus inversionistas si no espera necesitar el dinero en un plazo de 2 años.</p>\n<h1>Proceso de toma de decisiones</h1>\n<p>(Nótese que estos son sólo lineamientos y pueden ser cambiados. Sin embargo, los cambios deben seguir el espíritu de los lineamientos originales).</p>\n<p>La compañía es liderada por un CEO. Sus acciones son gobernadas por:</p>\n<ul>\n<li>Un consejo de expertos externos. El consejo apoya y aconseja al CEO y a los empleados</li>\n<li>Un equipo de gobierno, conformado por empleados y miembros del consejo de expertos. El equipo de gobierno da directivas (que deben ser seguidas) al CEO y sugieren cambios a las reglas y al proceso de decisiones. El equipo de gobierno tiene el derecho de despedir y mover de lugar a la gente (incluyendo al CEO)</li>\n</ul>\n<p>La empresa será dirigida de manera abierta y democrática:</p>\n<ul>\n<li>Toda la información (que no sea de los clientes) será hecha pública hacia dentro de la empresa. Esto incluye salarios, bonos, acciones, cumpleaños, etc…</li>\n<li>Las decisiones serán tomadas de manera democrática y todos los empleados deben tener la oportunidad de expresar sus ideas en decisiones que les conciernen.</li>\n<li>En ocasiones de desacuerdos las cosas deben de ser resultas votando con la regla de los 3 votos; “Sí, No y Nunca”. La decisión no deberá tomarse si hay un solo voto de nunca. En casos extraordinarios, de vida o muerte, después de haber agotado todas las demás posibilidades sin haber llegado a una solución, se podrá tomar una decisión aún si existen votos de ‘Nunca’, siempre y cuando el 51% de la empresa haya votado Sí.</li>\n<li>\n<p>La empresa debe trabajar de acuerdo al lema: “Toma buenas decisiones rápido, pero prepárate a cambiar rápidamente de curso si hay alguna manera.” Esto, para decisiones controversiales, implica:</p>\n<ul>\n<li>Si se solicita, los que toman una decisión deben definir claramente las bases de su decisión y proveer medios para probar que una decisión es en el mejor interés de la empresa. Si después, resulta que la decisión fue equivocada, debe ser revertida y analizarse que salió mal para que no suceda otra vez.</li>\n</ul>\n</li>\n<li>La empresa debe aprender de sus errores y aciertos. Debe tratar de repetir sus éxitos y evitar sus errores en el futuro.</li>\n</ul>\n<h2>Decisiones difíciles / Cambiando las reglas</h2>\n<p>Las reglas de la empresa sólo pueden ser cambiadas si al menos el 75% de los empleados no se oponen a los cambios.</p>\n<p>Los dueños del 51% de las acciones con derecho a voto (inicialmente sólo los fundadores) tienen el poder definitivo de decir ‘NO’ a cualquier decisión que no tenga el 75% de los votos de los empleados. También pueden proponer nuevas decisiones que serán tomadas si el 51% de los empleados las aprueban. Esta regla sólo puede ser cambiada con el 85% de las acciones con derecho a voto.</p>\n<h1>Condiciones de uso / Cómo utilizar</h1>\n<p>Este documento está en <a href=\"http://creativecommons.org/licenses/by-sa/3.0\">Creative Commons Attribution-Share Alike 3.0</a>. Siéntase libre para compartirlo y modificarlo.</p>\n<p>Estas reglas no están escritas de acuerdo a ninguna legislación ni se espera que sean válidas en ningún país. La idea es que cada empleado reciba un contrato de acuerdo a la jurisdicción de su país que contenga los mismos beneficios y responsabilidades que este documento hasta donde sea legalmente posible.</p>\n<p>Otras empresas utilizando estas reglas pueden referirlas como reglas base, y luego simplemente tener reglas adicionales o pequeños cambios a estas. Por ejemplo, una empresa francesa quizás prefiera estipular que el lenguaje principal es Frances, no inglés.</p>\n<p>Si tu empresa se suscribe a estas reglas, por favor agrega un link a esta página! Si tu empresa tiene reglas diferentes o adicionales, por favor mantenlas en tu propia página y utiliza esta como referencia para las reglas estándar.</p>\n<h1>Créditos</h1>\n<p>Creado por Zak Greant y Michael Widenius. Publicado primero por Zack Greant en <a href=\"http://zak.greant.com/hacking-business-models\">este blog</a>.</p>\n<p>Algunas entradas fueron inspiradas por el <a href=\"http://blog.secondlife.com/2006/07/25/the-tao-of-linden\">Tao de Linden</a></p>","frontmatter":{"title":"Hacking Business Model","date":"March 09, 2010","tags":["axai"]}}},"pageContext":{"slug":"/hacking-business-model/","previous":{"fields":{"slug":"/url-shorteners-y-estadisticas-de-visitas/"},"frontmatter":{"title":"URL shorteners y estadísticas de visitas","aliases":[],"tags":[]}},"next":{"fields":{"slug":"/que-preferencia-sexual-quisieras-que-tuvieran-tus-hijos/"},"frontmatter":{"title":"¿Qué preferencia sexual quisieras que tuvieran tus hijos?","aliases":["qu-preferencia-sexual-quisieras-que-tuvieran-tus-hijos"],"tags":["religion"]}}}}