{"data":{"site":{"siteMetadata":{"title":"La gaceta de la cabeza","author":"Joaquín Bravo Contreras","disqusShortname":"gaceta-de-la-cabeza"}},"markdownRemark":{"id":"42f256dc-73fb-5c5b-8a2e-1f20e352842b","excerpt":"Este tutorial es para sitios en drupal que utilizan el módulo de organic groups para crear comunidades virtuales. Al terminar el módulo…","html":"<p>Este tutorial es para sitios en drupal que utilizan el módulo de organic groups para crear comunidades virtuales. Al terminar el módulo tendrás una página donde se mostrarán únicamente las actividades específicas a tu grupo en forma de calendario.</p>\n<h3>Módulos Necesarios</h3>\n<p>Primero necesitas tener los siguientes módulos en tu sites/all/modules:</p>\n<ul>\n<li><a href=\"http://drupal.org/project/og\">og</a></li>\n<li><a href=\"http://drupal.org/project/cck\">cck</a></li>\n<li><a href=\"http://drupal.org/project/date\">date</a></li>\n<li><a href=\"http://drupal.org/project/views\">views</a></li>\n<li><a href=\"http://drupal.org/project/calendar\">calendar</a></li>\n</ul>\n<p>Los módulos que necesitas habilitar para que esto funcione (suponiendo que ya tienes og habilitado) son como mínimo: content, calendar, date, date api, date timezone, views y views ui. Al crear sitios con drupal lo mejor es habilitar los menos módulos posibles, ya que cada módulo que instalas tiene un impacto en el desempeño de tu sitio.</p>\n<h3>CCK y Date</h3>\n<p>Ahora hay que crear un tipo de contenido que tenga un campo de fecha. Para esto vamos a <code class=\"language-text\">admin/content/types</code> y creamos un tipo nuevo. No olvides que este tipo de contenido debe de poder pertenecer a un grupo. Yo le puse evento. Y luego le agregamos un campo de cck, puedes elegir 3 tipos de fecha: datestamp, datetime y date. Date es únicamente la fecha, datetime incluye hora y datestamp es el más específico. O al menos eso parece no? ;-).</p>\n<p>Crea algunos eventos de prueba.</p>\n<h3>Views y Calendar</h3>\n<p>Ahora viene lo bueno. Ve a la vista de administrar vistas en <code class=\"language-text\">admin/build/views</code> y activa la vista de calendario que nos va a servir como base. Esta vista la puedes editar para que todos los calendarios que crees tengan ciertos elementos en común:</p>\n<ol>\n<li>\n<p>Por ejemplo, a mi no me gusta que en la vista mensual me muestren el número de semana. Para corregir esto nos vamos a la vista de mes y en basic settings -> calendar damos click en el ícono de settings  y deshabilitamos esa opción.</p>\n</li>\n<li>\n<p>Tampoco me gusta que en la vista se desplieguen las etiquetas de los campos (Título:, Updated date:). Así que las podemos quitar.</p>\n</li>\n<li>\n<p>Normalmente nada más quieres que se puedan ver los nodos publicados, así que hay que agregar un filtro de Nodo: publicado = TRUE.</p>\n</li>\n<li>\n<p>Finalmente, el cambio que considero más importante es hacer que las vistas de calendario, por default, utilicen el campo de fecha que acabamos de crear en lugar de la fecha de última actualización de los nodos. Para hacer esto vamos a editar el argumento de fecha (node.changed):</p>\n</li>\n<li>\n<p>como el sitio está en español, cambia las cadenas que dicen ‘all’ por ‘todos’</p>\n</li>\n<li>\n<p>quita la palomita al campo Nodo: update date</p>\n</li>\n<li>\n<p>pon una palomita al campo tu campo de fecha, en mi caso Contenido: Datestamp: Fecha (field<em>fecha</em>futura)</p>\n</li>\n<li>\n<p>guarda tus cambios</p>\n</li>\n</ol>\n<p>Esta vista de calendario (a la que puedes navegar en el url calendar) ya nos sirve como punto de partida, y si la visitas podrás ver una vista general de todas las actividades programadas en tu sitio.</p>\n<h3>OG, Views y Arguments</h3>\n<p>Ahora nada más falta hacer una vista que te muestre nada más las actividades del grupo en el que te encuentres. Para esto vamos a usar un elemento muy poderoso de las vistas: argumentos.</p>\n<p>Los argumentos sirven para personalizar tu vista de acuerdo a información que reciben de diversas fuentes, normalmente el url de tu vista. Entonces:</p>\n<ol>\n<li>\n<p>Desde la lista de vistas, clona la vista del calendario base (calendar). Yo a esta vista la nombre calendario_grupo y su descripción es eso precisamente: Calendario de grupos. Next.</p>\n</li>\n<li>\n<p>Vamos a agregar un argumento: Grupos: Grupos. Este argumento lo que hace es mostrar únicamente los nodos que pertenezcan al grupo que especifiques en el argumento. Add. </p>\n</li>\n</ol>\n<p>  <img src=\"http://joaquin.axai.mx/sites/joaquin.axai.mx/files/argumento_grupo.png\" alt=\"Agregar grupo\"></p>\n<ol start=\"3\">\n<li>\n<p>Este argumento de grupo debe aparecer antes del argumento de fecha, así que hay que reordenarlos presionando este ícono: </p>\n</li>\n<li>\n<p>Hay que modificar la ruta de la vista de página para que sepa que forzosamente debe llevar un argumento, así que la vamos a cambiar de calendara calendario/%</p>\n</li>\n</ol>\n<p>Y listo, con esto ya sabes lo básico para adecuarla a tus necesidades. Si navegas en tu sitio a (/calendario/id<em>de</em>un_grupo)[http://fef-apostolado.org/calendario/50], podrás ver tu vista de calendario ;-).</p>","fields":{"slug":"/crear-un-calendario-de-grupo-con-drupal/"},"frontmatter":{"title":"Crear un calendario de grupo con drupal","date":"September 10, 2008","tags":["drupal","views"]}}},"pageContext":{"slug":"/crear-un-calendario-de-grupo-con-drupal/","previous":{"fields":{"slug":"/usando-tags-de-taxonomia-para-organizar-el-contenido-en-drupal/"},"frontmatter":{"title":"Usando tags de taxonomía para organizar el contenido en drupal","aliases":["2008/08/26/usando-tags-de-taxonom-para-organizar-el-contenido-en-drupal"],"tags":["drupal","axai"]}},"next":{"fields":{"slug":"/como-explicar-la-recursion/"},"frontmatter":{"title":"¿Cómo explicar la recursión?","aliases":["2008/09/19/c-mo-explicar-la-recursi-n"],"tags":["programacion"]}}}}