{"data":{"site":{"siteMetadata":{"title":"La gaceta de la cabeza","author":"Joaquín Bravo Contreras"}},"markdownRemark":{"id":"dd57ca3d-d9a2-509e-8723-0a46b8676262","excerpt":"No se cómo voy a votar este 5 de Julio. Estoy harto de la política mexicana, todos los días escuchas noticias de algún político que se robó…","html":"<p>No se cómo voy a votar este 5 de Julio. Estoy harto de la política mexicana, todos los días escuchas noticias de algún político que se robó una lana, que no declaró tales bienes, que está asociado con tales gentes… O a veces hasta prefiero no prestar atención. Lo malo es que vienen las votaciones, y pues ya no se puede NO prestar atención.</p>\n<p>Para estas votaciones me encanta la idea que está en boca de todos de ANULAR mi voto. Y decirles a los políticos: ¡NINGUNO MERECE MI VOTO! perros.</p>\n<p>Varios amigos, familiares, conocidos están en las mismas. Y creo que el ejercicio que proponen en el grupo de <a href=\"http://anulalos.blogspot.com/\">Anúlalos</a> (que me llegó por facebook) es el más apropiado, aunque parezca medio zonzo. El ejercicio va así:</p>\n<ol>\n<li>Analizar a los candidatos de nuestra localidad. Si te convence alguno, se acabó el ejercicio =P.</li>\n<li>Si no. Considera las opciones restantes: No votar o anular el voto.</li>\n</ol>\n<p>Está fácil no. Lo malo es que el primer paso nadie lo hacemos. Y desde ahí estamos muy mal. ¿Cómo queremos que los políticos cambien cuando a nosotros nos vale queso en realidad la política? Yo hasta hace unos días no tenía ni idea de los nombres de los candidatos a la presidencia municipal de Zapopan. Ni digamos los candidatos a diputados de mi distrito.</p>\n<p>Entonces, antes de decidir si vas a anular tu voto, creo que deberíamos empezar por ahí. Hace poco marcaron a la oficina de las oficinas de Hector Vielma (candidato del PRI) para ver si quería que visitara mi colonia. Les dije que sí. También pasaron a avisarnos que Guillermo Martínez (candidato del PAN) iba a estar en un parquecito por aquí cerquita para contestar las dudas que tuviéramos, y al final ni siquiera pude ir por la chamba… No está tan fácil conocerlos =P. Pero es el primer paso.</p>","frontmatter":{"title":"Anular el voto, o no anular el voto, esa es la cuestión","date":"June 08, 2009"}}},"pageContext":{"slug":"/anular-el-voto-o-no-anular-el-voto-esa-es-la-cuestion/","previous":{"fields":{"slug":"/historia-de-olpc/"},"frontmatter":{"title":"Historia de OLPC","aliases":[]}},"next":{"fields":{"slug":"/usando-la-consola-cuanto-miden-tus-particiones-y-carpetas/"},"frontmatter":{"title":"Usando la consola: Cuanto miden tus particiones y carpetas?","aliases":[]}}}}