{"data":{"site":{"siteMetadata":{"title":"La gaceta de la cabeza","author":"Joaquín Bravo Contreras"}},"markdownRemark":{"id":"9e651e71-0be6-5bb2-833c-5e78fcf417bf","excerpt":"Este mensaje me llegó hace ya un año, desde  hattrick  que es un sitio donde diriges un equipo de futbol, entrenas a tus jugadores, vendes y…","html":"<p>Este mensaje me llegó hace ya un año, desde <a href=\"http://www.hattrick.org\">hattrick</a> que es un sitio donde diriges un equipo de futbol, entrenas a tus jugadores, vendes y compras para tu equipo y mil cosas más. La verdad está muy chido, pero después de unos años lo dejé. Luego me llegó este mensaje chantajista… y pues volví =P jeje. Qué mendigos! hasta me acordaba del jugador, Arco Busing.</p>\n<hr>\n<p>¡Hola entrenador!</p>\n<p>Soy Arco Busing, el antiguo capitán de tu equipo de Hattrick: Las Cabezas. ¿Te acuerdas de mí?</p>\n<p>Quería contarte que las cosas ya no son como eran antes en el antiguo vecindario. Los aficionados echan en falta un equipo al que seguir… y yo siento lo mismo. ¿Estarías dispuesto a retomar tu carrera como mánager?</p>\n<p>De hecho, jefe, este podría ser el momento para darle otra oportunidad. Han cambiado muchas cosas en Hattrick. Hay un diseño nuevo, los servidores son más rápidos y hay un montón de características nuevas desde que te fuiste.</p>\n<p>Pensamos que sería increíble tenerte de vuelta con nosotros. Echa un vistazo al nuevo sitio aquí - y si sientes que te gusta, podrás empezar con un equipo nuevo ¡ahora mismo! </p>\n<p>Y si lo haces, ¡puedes estar seguro de que tanto los otros antiguos jugadores como yo estaremos siempre en los palcos!</p>","frontmatter":{"title":"Un retorno a Hattrick","date":"May 22, 2010"}}},"pageContext":{"slug":"/un-retorno-a-hattrick/","previous":{"fields":{"slug":"/que-preferencia-sexual-quisieras-que-tuvieran-tus-hijos/"},"frontmatter":{"title":"¿Qué preferencia sexual quisieras que tuvieran tus hijos?","aliases":["qu-preferencia-sexual-quisieras-que-tuvieran-tus-hijos"],"tags":["religion"]}},"next":{"fields":{"slug":"/redirigir-los-dominios-www-usando-aegir-y-nginx/"},"frontmatter":{"title":"redirigir los dominios www usando aegir y nginx","aliases":[],"tags":["drupal"]}}}}