{"data":{"site":{"siteMetadata":{"siteUrl":"https://joaquin.axai.mx/","title":"La gaceta de la cabeza","author":"Joaquín Bravo Contreras","disqusShortname":"gaceta-de-la-cabeza"}},"markdownRemark":{"id":"634e11ad-5c5b-5b15-a036-8d2787d2a99c","excerpt":"Tomé un curso del open university, a través del iTunes sobre cómo escribir un ensayo. El título del curso es “Start Writing Essays”. Estas…","html":"<p>Tomé un curso del open university, a través del iTunes sobre cómo escribir un ensayo. El título del curso es “Start Writing Essays”. Estas son mis notas. Pero si tienes 20 minutos (eso toma el curso), te recomiendo escucharlo. Lo puedes <a href=\"http://podcast.open.ac.uk/oulearn/arts-and-humanities/podcast-a172-start-writing-essays\">escuchar por internet</a> o <a href=\"http://itunes.apple.com/us/itunes-u/start-writing-essays-audio/id380223854\">bajar a tu iTunes</a>.</p>\n<p>Lo primero es hacer la investigación sobre tu tema. El chiste es que tengas confianza sobre tu conocimiento sobre el tema a tratar y durante el proceso puedes ir tomando notas e identificando ideas que quieres que formen parte de tu ensayo. Apunta citas de libros, personajes o autores que encuentres. Es una buena idea asignar un periodo de tiempo definido para la investigación para evitar seguir en esto indefinidamente.</p>\n<p>Una vez tengas algo masticado el tema lo primero que viene a la mente es darle un título a tu ensayo. Éste le da identidad a tu escrito y una intención. Puede que cambie mientras escribas el ensayo, pero es una buena manera de empezar y te da un buen punto de comparación para que una vez que termines veas si realmente cumpliste con la intención que te habías propuesto con el título.</p>\n<p>Opinión. Si tienes una opinón respecto al tema, muestrala. Si estas escribiendo un cuento, o un texto informativo, o simplemente explicando algo, es posible que no exista una opinón. Pero al menos detente a pensar un momento en si tu texto está comunicando efectivamente tu opinión sobre el tema. Y casi se me olvida, pero que nunca te pase a tí, pon tu opinión a prueba y en tu investigación busca opiniones contrarias.</p>\n<p>Estilo. Algo debe de ser dicho sobre el estilo. Pero no demasiado, cada quien tiene el suyo. Simplemente escúchate hablar, y quizás en el proceso de escribir termines cambiando tu estilo de hablar porque descubres que eres muy grosero (ups! me proyecté). Cómo es tu vocabulario? Académico? Callejero? Jovial? (jojo). Al final depende de tí y del público al que estás escribiendo. Simplemente diría que no hay que forzarlo o exagerarlo. Lo importante es comunicar una idea. Un buen consejo de <a href=\"http://en.wikipedia.org/wiki/Helena_Kennedy,_Baroness_Kennedy_of_The_Shaws\">Helena Kennedy</a> que escuché en el curso es que al escribir imagines que estás hablando con alguien. Ella al escribir para una revista se imagina hablando con sus hermanas, cuando escribe para una columna en el periódico está platicando con su mamá y cuando es para un texto especializado se ve en una converzación con sus colegas.</p>\n<p>Si sigues estos consejos creo que muy difícilmente te vas a bloquear, porque investigando tienes la mayoría del material listo y simplemente tienes que ir rellenando. No tienes que empezar desde el principio. Revisa tus notas, escribe las ideas principales, las conclusiones y la mejor manera de empezar llegaran sólas con el tiempo. Si sí te llegas a bloquear el consenso general es que lo mejor es distraerte. Tómate una cerveza, lava los platos, salte a correr, platica con alguien, lee algo, ¡salte del tema! Y regresa después =).</p>","fields":{"slug":"/como-escribir-un-articulo-blog-ensayo/"},"frontmatter":{"title":"¿Cómo escribir un artículo / blog / ensayo?","date":"February 02, 2011","tags":["blogs"]}}},"pageContext":{"slug":"/como-escribir-un-articulo-blog-ensayo/","previous":{"fields":{"slug":"/que-buenos-eran-los-muppets/"},"frontmatter":{"title":"Que buenos eran los Muppets!","aliases":[],"tags":[]}},"next":{"fields":{"slug":"/el-nino-robot/"},"frontmatter":{"title":"El niño robot","aliases":[],"tags":["cuentos"]}}}}