{"data":{"site":{"siteMetadata":{"siteUrl":"https://joaquin.axai.mx/","title":"La gaceta de la cabeza","author":"Joaquín Bravo Contreras","disqusShortname":"gaceta-de-la-cabeza"}},"markdownRemark":{"id":"66d6f61d-1991-5710-9c49-34e37f6d87b8","excerpt":"¿Está cañón no? Esta pregunta me la estuve haciendo hace mucho tiempo y ahorita me acordé de ella leyendo el blog de  un amigo . Lo que pasa…","html":"<p>¿Está cañón no?</p>\n<p>Esta pregunta me la estuve haciendo hace mucho tiempo y ahorita me acordé de ella leyendo el blog de <a href=\"http://experimentoposmo.blogspot.com/2010/05/no-si-yo-hasta-tengo-amigos-gays-pero.html\">un amigo</a>. Lo que pasa es que hoy en día se escucha mucho decir, “No, si yo hasta amigos gays tengo, pero de eso a que tengan hijos…” y algo de verdad hay en que detrás de esa frase se esconde la homofobia.</p>\n<p>Lo que pasa es que estamos mal informados y tenemos miedo. Creemos que el hijo de un matrimonio homosexual va a crecer trastornado, deprimido, se va a volver drogadicto y le va a ir mal en la escuela. Buscando información al respecto no encontré nada actual que diga que esto es cierto. Busquen en la <a href=\"http://es.wikipedia.org/wiki/Matrimonio_entre_personas_del_mismo_sexo#Efectos_del_matrimonio_entre_personas_del_mismo_sexo\">wikipedia</a> o en este otro de un <a href=\"http://www.20minutos.es/noticia/32872/0/matriomonios/homosexuales/informes/\">periódico español</a> que pone puntos a favor y en contra.</p>\n<p>A final de cuentas a mi lo que me enseñaron de chiquito es que hay que respetar e incluso amar a todas las personas, no hay que discriminar y no hay que tener prejuicios. Realmente creemos que un niño va a estar mejor en un orfanato que siendo criado por una pareja homosexual (de hombres o mujeres) que decidieron estar juntos con todas las de la ley?</p>\n<p>Incluso yo decía, bueno, si llegan a permitir que parejas homosexuales adopten entonces deberían de agregar una pregunta al examen que les hagan a las parejas candidatas. A los heterosexuales que les pregunten ¿si tienes un hijo homosexual, cómo lo vas a tratar? Y pues claro esperando que digan que con amor e igual a cualquier otro hijo. Y a las parejas homosexuales que les pregunten ¿qué preferencia sexual quisieras que tuvieran tus hijos? Y la respuesta correcta debería de ser: heterosexual, porque así se evitan toda la discriminación y problemas que hemos tenido nosotros.</p>\n<p>Pero en realidad esa pregunta también está mal. Sigues favoreciendo el miedo. Ahora creo que la pregunta que se debería agregar al examen es la misma para homosexuales y heterosexuales:</p>\n<p>¿Qué preferencia sexual quisieras que tuvieran tus hijos?</p>\n<ul>\n<li>Heterosexual</li>\n<li>Homosexual</li>\n<li>La que sea yo los voy a querer igual</li>\n</ul>","fields":{"slug":"/que-preferencia-sexual-quisieras-que-tuvieran-tus-hijos/"},"frontmatter":{"title":"¿Qué preferencia sexual quisieras que tuvieran tus hijos?","date":"May 20, 2010","tags":["religion"]}}},"pageContext":{"slug":"/que-preferencia-sexual-quisieras-que-tuvieran-tus-hijos/","previous":{"fields":{"slug":"/hacking-business-model/"},"frontmatter":{"title":"Hacking Business Model","aliases":["hacking-business-rules"],"tags":["axai"]}},"next":{"fields":{"slug":"/un-retorno-a-hattrick/"},"frontmatter":{"title":"Un retorno a Hattrick","aliases":["un-retorno-hattrickk","un-retorno-hattrick"],"tags":[]}}}}