{"data":{"site":{"siteMetadata":{"title":"La gaceta de la cabeza","author":"Joaquín Bravo Contreras","disqusShortname":"gaceta-de-la-cabeza"}},"markdownRemark":{"id":"e8100fe2-2a2e-51d3-9957-cea8990b4e9b","excerpt":"\n\t\t\t\t\nEsta es mi bicicleta. La compramos entre mi novia y yo para mi cumpleaños hace casi un año después de mucho tiempo de no usar una…","html":"<p><a href=\"http://www.flickr.com/photos/jackbravo/2430405222/\" title=\"photo sharing\"><img src=\"http://farm4.static.flickr.com/3045/2430405222_f769a0d4a1.jpg\" class=\"flickr-photo\" alt=\"\"></a>\n\nEsta es mi bicicleta. La compramos entre mi novia y yo para mi cumpleaños hace casi un año después de mucho tiempo de no usar una. Esta algo pesada, pero no soy ningún deportista de alto rendimiento ;-) así que creo que está bien.</p>\n<p>Desde hace algunos meses me estoy yendo en bicicleta a la oficina. El dicho de “la mejor escuela es la que te queda cerca” creo que también puede aplicar bastante bien aquí en Guadalajara para el trabajo. El tráfico a casi todas horas es imposible y no digamos la contaminación (estamos ya igual o peor que el D.F.), así que intento contribuir con mi granito de arena al problema y de paso hacer un poco de ejercicio. La vida sedentaria de un programador no ayuda mucho a la salud.</p>\n<p>¿Alguien sabe de qué lado es mejor circular en bicicleta? ¿de acuerdo a la circulación de los coches? o en contra? He preguntado a algunos amigos y todos dan respuestas diferentes. Por lo pronto yo me siento más seguro circulando igual que los coches.</p>\n<p><strong>UPDATE</strong>: Ojo, no hay discusión, la manera más segura de circular es en el mismo sentido de los coches. Lean el comentario de abajo. Gracias Cano.</p>","fields":{"slug":"/en-bicicleta-al-trabajo/"},"frontmatter":{"title":"En bicicleta al trabajo","date":"April 21, 2008","tags":["bicicleta"]}}},"pageContext":{"slug":"/en-bicicleta-al-trabajo/","previous":{"fields":{"slug":"/compilando-git-en-ubuntu-710/"},"frontmatter":{"title":"Compilando git en ubuntu 7.10","aliases":["2008/02/10/compilando-git-en-ubuntu-710"],"tags":["git","linux","ubuntu"]}},"next":{"fields":{"slug":"/installing-ubuntu-codecs-restricted-formats/"},"frontmatter":{"title":"Installing Ubuntu codecs (restricted formats)","aliases":["2008/04/29/installing-ubuntu-codecs-restricted-formats"],"tags":[]}}}}