{"data":{"site":{"siteMetadata":{"siteUrl":"https://joaquin.axai.mx/","title":"La gaceta de la cabeza","author":"Joaquín Bravo Contreras","disqusShortname":"gaceta-de-la-cabeza"}},"markdownRemark":{"id":"7f91b16e-37d8-5bce-b59c-caf7ec1d8be2","excerpt":"El propósito de mi post  pasado  no era otro sino el de decirle a  Technorati  que este blog es mío. Es decir, asociarlo con mi  perfil en…","html":"<p>El propósito de mi post <a href=\"http://joaquin.axai.mx/es/2007/11/09/technorati-blog-claim\">pasado</a> no era otro sino el de decirle a <a href=\"http://technorati.com/\">Technorati</a> que este blog es mío. Es decir, asociarlo con mi <a href=\"http://technorati.com/claim/v9euh2cnzz\" rel=\"me\">perfil en technorati</a>.</p>\n<p>Technorati es <strong>EL</strong> sitio para buscar <a href=\"http://es.wikipedia.org/wiki/Blog\">blogs</a>. Los autores de blogs se registran en technorati y luego registran a su blog (por medio de <a href=\"http://es.wikipedia.org/wiki/Rss\">rss</a>). Technorati después publica en diferentes <a href=\"http://technorati.com/technology/\">categorías</a> todos (y digo TODOS) los nuevos artículos que se publican en todos (y digo TODOS) los blogs registrados ahí, como se pueden imaginar son muchísimos. Las personas que tienen un blog en technorati pueden votar por los artículos que les parecen más relevantes y de esta manera un blog puede ir ganando autoridad. Los blogs y usuarios con mayor autoridad tienen un voto más fuerte y sus artículos se muestran con mayor visibilidad dentro del sitio de technorati.</p>\n<p>Así que si estás empezando un nuevo blog, o ya tienes uno pero nunca has entrado a technorati ¿Qué esperas? No hay mejor manera de darle visibilidad a tu sitio en internet. Claro que tienes que escribir regularmente, no como yo que lo hago una vez cada 2 meses =P.</p>","fields":{"slug":"/que-es-eso-del-technorati-blog-claim/"},"frontmatter":{"title":"¿Que es eso del technorati blog claim?","date":"February 07, 2008","tags":["blogs"]}}},"pageContext":{"slug":"/que-es-eso-del-technorati-blog-claim/","previous":{"fields":{"slug":"/noticias-sobre-php5/"},"frontmatter":{"title":"Noticias sobre PHP5","aliases":[],"tags":["php"]}},"next":{"fields":{"slug":"/compilando-git-en-ubuntu-710/"},"frontmatter":{"title":"Compilando git en ubuntu 7.10","aliases":["2008/02/10/compilando-git-en-ubuntu-710"],"tags":["git","linux","ubuntu"]}}}}