{"data":{"site":{"siteMetadata":{"siteUrl":"https://joaquin.axai.mx/","title":"La gaceta de la cabeza","author":"Joaquín Bravo Contreras","disqusShortname":"gaceta-de-la-cabeza"}},"markdownRemark":{"id":"bb977d2c-e810-5b04-947d-09b5b530f144","excerpt":"Acabo de leer sobre  Democracia 2.0  en un  post  de la cofradía. Como no me pude registrar ahí, pongo mis comentarios en este post…","html":"<p>Acabo de leer sobre <a href=\"http://www.d20.org.mx/\">Democracia 2.0</a> en un <a href=\"http://cofradia.org/2013/02/16/convocatoria-para-desarrollar-plataforma-de-participacion-ciudadana/\">post</a> de la cofradía. Como no me pude registrar ahí, pongo mis comentarios en este post. Democracia 2.0 al parecer es una iniciativa para formar una plataforma tecnológica democrática para un nuevo partido político (posiblemente llamado democracia 2.0). La idea me gusta mucho.</p>\n<p>Ya antes había escuchado de una idea similar, por parte del <a href=\"http://www.animalpolitico.com/blogueros-la-ultraizquierda-de-la-ultraderecha/2012/05/23/lo-ultimo-sobre-el-wikipartido-de-mexico/\">wikipartido</a> y me lamentaba que ambas organizaciones no funcionaran de manera conjunta. En el post de la cofradía la gente de D20 responde esta pregunta. En lo personal, cuando supe del wikipartido, también despertó mucho mi interés y me registré, pero creo que con ellos ha faltado mucho la comunicación. Mi sugerencia sería poner inmediatamente un blog, con RSS, subir el código de sus desarrollos a github o algún otro repositorio público y constantemente estar haciendo anuncios, para que no pase lo mismo. Si tienen reuniones como la del DF, poner una minuta en el blog, para los que no podemos asisitir porque somos de ciudades diferentes. Comunicación.</p>\n<p>Twitter puede ser un medio de comunicación también, pero a mi modo de ver siempre debe ir acompañado de un blog. Twitter no permite el mismo tipo de discusiones que pueden surgir desde un blog, y es fácil que información importante se pierda en el mar de tweets que se publican diariamente.</p>\n<p>Suerte!</p>","fields":{"slug":"/sobre-democracia-20-y-el-wikipartido/"},"frontmatter":{"title":"Sobre Democracia 2.0 y el wikipartido","date":"March 07, 2013","tags":[]}}},"pageContext":{"slug":"/sobre-democracia-20-y-el-wikipartido/","previous":{"fields":{"slug":"/sobre-la-fe/"},"frontmatter":{"title":"Sobre la fe","aliases":[],"tags":[]}},"next":{"fields":{"slug":"/demostracion-de-vim-para-edicion-rapida-de-archivos-/"},"frontmatter":{"title":"Demostración de VIM para edición rápida de archivos ","aliases":["demostraci-n-de-vim-para-edici-n-r-pida-de-archivos"],"tags":["drupal"]}}}}