{"data":{"site":{"siteMetadata":{"title":"La gaceta de la cabeza","author":"Joaquín Bravo Contreras"}},"markdownRemark":{"id":"25b7f62b-608a-5aeb-8fc4-e3622213b25d","excerpt":"Axai , la empresa donde trabajo desde hace año y medio, está creciendo. O al menos tenemos más trabajo ;-) ya que la definición de…","html":"<p><a href=\"http://axai.com.mx\">Axai</a>, la empresa donde trabajo desde hace año y medio, está creciendo. O al menos tenemos más trabajo ;-) ya que la definición de crecimiento es algo ambigua para las empresas. Y estamos buscando a una o dos personas que quieran formar parte de nuestro equipo.</p>\n<p>A axai la describiría como un taller de desarrollo web. Somos una PyME mexicana. Nos gusta utilizar tecnologías nuevas y programar seriamente (control de versiones, pruebas de software, MVC, JQuery). Somos 4 personas, 1 especializada en la consultoría de negocios y los otros 3 desarrollando y creando sistemas y portales. No la pasamos muy a gusto y aprendemos cosas nuevas todos los días.</p>\n<p>Eres candidato si:</p>\n<ul>\n<li>te gusta y eres bueno para programar</li>\n</ul>\n<p>creo que es todo. jajaja. Ya en serio, si realmente te apasiona la programación creo que ya con eso tenemos, pero también es muy importante saber leer y escribir inglés. Si hablar te da penita o no tienes práctica no hay pex, eso se da con el tiempo.</p>\n<p>Estamos buscando personas principalmente para dos proyectos.</p>\n<p><strong>Programación web</strong>. Es lo que más hacemos, nos estarías ayudando a programar los sistemas y sitios web que hacemos todos los días, principalmente usando <a href=\"http://drupal.org\">Drupal</a> o <a href=\"http://www.symfony-project.org\">Symfony</a>. No tienes que conocer las herramientas, pero ayuda si te gusta programar PHP, MySQL, Javascript y CSS. También tenemos por ahí algunos proyectos en ASP.</p>\n<p><strong>Programador de aplicaciones</strong>\nNecesitamos alguien que sepa o no le intimide programar en C y C++. Aquí vas a programar interfaces para pruebas de un co-procesador de video para (hint hint, guiño guiño) importante empresa.</p>\n<p>Dudas pues me pueden contactar por <a href=\"http://joaquin.axai.mx/contact\">aquí</a> o directo en la de <a href=\"http://axai.com.mx/contact\">axai</a> y pues si conocen a alguien que le interese le platican también.</p>\n<hr>\n<p>Para ver otras formas de comunicar este mismo mensaje chequen los posts de mis compañeros:</p>\n<ul>\n<li><a href=\"http://bit.ly/186qo5\">http://bit.ly/186qo5</a></li>\n<li><a href=\"http://bit.ly/EPtcM\">http://bit.ly/EPtcM</a></li>\n</ul>","frontmatter":{"title":"Se busca programador","date":"September 08, 2009"}}},"pageContext":{"slug":"/se-busca-programador/","previous":{"fields":{"slug":"/guadalajara-devhouse-y-otros-eventos-tecnologicos-en-la-ciudad/"},"frontmatter":{"title":"Guadalajara DevHouse y otros eventos tecnológicos en la ciudad","aliases":[],"tags":["programacion"]}},"next":{"fields":{"slug":"/dolores-de-cabeza-instalando-el-stack-de-microsoft/"},"frontmatter":{"title":"Dolores de cabeza instalando el stack de microsoft","aliases":[],"tags":[]}}}}