{"data":{"site":{"siteMetadata":{"title":"La gaceta de la cabeza","author":"Joaquín Bravo Contreras","disqusShortname":"gaceta-de-la-cabeza"}},"markdownRemark":{"id":"9501e9f6-1c67-5733-9eff-25e7c806eb9c","excerpt":"Cuando era pequeño recuerdo que yo era un robot. No como quien jugando se imagina que es un robot del futuro o algo así. No, yo realmente…","html":"<p>Cuando era pequeño recuerdo que yo era un robot. No como quien jugando se imagina que es un robot del futuro o algo así. No, yo realmente era un robot.</p>\n<p>No recuerdo muy bien cómo me di cuenta. Creo que empezó como un presentimiento pero que poco a poco se convirtió en certeza.</p>\n<p>Mi papá me contó de la vez que de chiquito me llevó al tío vivo. Mi papá gritaba “Hey Joaquín!!!” y me hacía gestos para que me riera mientras el carrucel daba vueltas, pero yo no dejaba de analizar la maquinaria que hacía que aquella cosa girara, mientras los otros niños no paraban de reír y jugar en su caballito.</p>\n<p>Mi hermano también sabía que yo era un robot. Jugábamos luchitas, y cuando me cansaba de fingir que no podía con él, utilizaba mi fuerza robótica para lanzarlo muy lejos. Él se quedaba asombrado.</p>\n<p>Me gustaba jugar futbol, porque ahí mi determinación robótica encontraba algo en que concentrar todo su esfuerzo. Objetivo: ningún delantero debe meter gol. Y me desconcertaba un poco cuando algún amigo se enojaba, porque yo, siendo robot, no entendía del todo las emociones humanas.</p>\n<p>No crean que no tenía sentimientos. Como dije, disfrutaba el futbol, había una niña que me encantaba aunque nunca se lo dije y lloré cuando al entrar a segundo año de primaria descubrí que mi mejor amigo se había cambiado de escuela. Pero cada sentimiento que me llegaba era como un nuevo programa que yo tenía que analizar lentamente antes de que finalmente quedara instalado en mi sistema.</p>\n<p>Con todo terminé adaptándome a la vida como humano a tal punto que ahora por fin puedo decir, soy un niño de verdad.</p>\n<p>O no?</p>","fields":{"slug":"/el-nino-robot/"},"frontmatter":{"title":"El niño robot","date":"February 05, 2011","tags":[]}}},"pageContext":{"slug":"/el-nino-robot/","previous":{"fields":{"slug":"/como-escribir-un-articulo-blog-ensayo/"},"frontmatter":{"title":"¿Cómo escribir un artículo / blog / ensayo?","aliases":["como-escribir-un-articulo-ensayo-o-blog"],"tags":["blogs"]}},"next":{"fields":{"slug":"/el-risk-y-la-mala-suerte/"},"frontmatter":{"title":"El Risk y la mala suerte","aliases":[],"tags":[]}}}}