{"data":{"site":{"siteMetadata":{"title":"La gaceta de la cabeza","author":"Joaquín Bravo Contreras","disqusShortname":"gaceta-de-la-cabeza"}},"markdownRemark":{"id":"6964ad5e-95c8-5b2d-b6ba-63b59228ca9f","excerpt":"El módulo de taxonomy de  drupal  sirve para organizar el contenido de tu sitio. Ese módulo es muy poderoso, y permite muchos tipos de…","html":"<p>El módulo de taxonomy de <a href=\"http://drupal.org\">drupal</a> sirve para organizar el contenido de tu sitio. Ese módulo es muy poderoso, y permite muchos tipos de categorizaciones: jerárquicas, lineales, jerárquicas pero con múltiples padres.</p>\n<p>Uno de los métodos más populares del web 2.0 (buzzwords por favor) es utilizar tags, o en términos de drupal, categorización libre. Donde a cada contenido que publicar le asignas varias etiquetas de acuerdo al tema que estás tratando.</p>\n<p>En la página de <a href=\"http://axai.com.mx\">axai</a> contamos con un blog empresarial donde publicamos cosas que nos parecen interesantes, nuestro trabajo y en general lo que va pasando con nuestra empresa. Estos artículos están categorizados libremente, PERO, pero pero pero, de cualquier manera ese libremente tiene que tener algo de sentido.</p>\n<p>Les pongo un ejemplo. Hace poco empezamos a subir artículos con los sitios que hemos estado terminando. Los tags que les estamos poniendo a estos artículos son:</p>\n<ul>\n<li><a href=\"http://axai.com.mx/es/tags/drupal\">drupal</a>: cuando el artículo en general tiene que ver con drupal</li>\n<li><a href=\"http://axai.com.mx/es/tags/sitios-en-drupal\">sitios en drupal</a>: cuando el sitio está hecho en drupal</li>\n<li><a href=\"http://axai.com.mx/es/tags/portafolio\">portafolio</a>: cuando es un sitio que podemos mostrar como parte de nuestro portafolio</li>\n<li><em><a href=\"http://axai.com.mx/es/tags/Axai\">nombre del cliente</a></em></li>\n</ul>\n<p>Así, cuando queramos montar una liga a nuestro portafolio en nuestro sitio, no tendremos más que apuntar a ese tag. O cuando queramos mostrar sitios hechos en drupal únicamente (también tenemos sitios con symfony o en flash), o todos los artículos relacionados con algún cliente, o… tienen la idea no?</p>\n<p>Entonces, todo el chiste está en ser consistente. También, si los artículos los escribe más de una persona, pues hay que encontrar la manera de comunicarse y estar de acuerdo en los tags que se están usando para que estos sean más efectivos. Recuerden que además, estos tags ayudan al ranking con los buscadores ;-).</p>","fields":{"slug":"/usando-tags-de-taxonomia-para-organizar-el-contenido-en-drupal/"},"frontmatter":{"title":"Usando tags de taxonomía para organizar el contenido en drupal","date":"August 26, 2008","tags":["drupal","axai"]}}},"pageContext":{"slug":"/usando-tags-de-taxonomia-para-organizar-el-contenido-en-drupal/","previous":{"fields":{"slug":"/backups-de-mysql-con-git/"},"frontmatter":{"title":"Backups de MySQL con git","aliases":["2008/08/05/backups-de-mysql-con-git"],"tags":["git","mysql"]}},"next":{"fields":{"slug":"/crear-un-calendario-de-grupo-con-drupal/"},"frontmatter":{"title":"Crear un calendario de grupo con drupal","aliases":["2008/09/10/crear-un-calendario-de-grupo-con-drupal"],"tags":["drupal","views"]}}}}