{"data":{"site":{"siteMetadata":{"siteUrl":"https://joaquin.axai.mx/","title":"La gaceta de la cabeza","author":"Joaquín Bravo Contreras","disqusShortname":"gaceta-de-la-cabeza"}},"markdownRemark":{"id":"63a8b8e7-69d7-530f-9793-9d836b21022c","excerpt":"Este texto publicado por un amigo en facebook ya es viejito, pero un amigo no tiene facebook y lo publico aquí para que lo pueda ver =). En…","html":"<p>Este texto publicado por un amigo en facebook ya es viejito, pero un amigo no tiene facebook y lo publico aquí para que lo pueda ver =).</p>\n<hr>\n<p>En estos últimos días, con la visita del Papa, líder de la iglesia Católica, han surgido muchas protestas que han llamado mi atención, tanto por la falta de fundamento como por la falta de información al realizar las mismas acusaciones de siempre… “El Papa protege a los pederastas”… “La visita del Papa costo X$ de millones de pesos y hay Tarahumaras muriendo de hambre”… Y yo como católico en lo personal no me vi ofendido, la libertad de expresión es algo por lo que estoy a favor.</p>\n<p>Pero algo con lo que definitivamente no estoy de acuerdo, es con las acusaciones sin sentido y vacias, realizadas por esta extraña “moda” de culpar a la iglesia de aparantemente todos los males sobre la tierra y de la hipocresía de las personas al criticar las vestimentas de alto precio del Papa. La Iglesia, al ser una institución humana tiene errores humanos, así que les invito a que lean el siguiente texto, no a modo de defensa ni de tomar partido, sino de ampliar un poco mas alla de los posts de 9gag y Facebook, la visión de las cosas sobre este tema.</p>\n<p>Quiero empezar con este ultimo punto. ¿De verdad somos tan hipócritas para lanzar una piedra y luego esconder la mano? ¿Como criticar a alguien que usa tunicas caras y demás acusaciones, cuando por lo menos el 60% de las personas que utilizan Facebook, terminaron la preparatoria, probablemente tienen un iPod o un genérico, tienen ropa para vestirse, transporte propio, comida todos los días, televisión, dinero para salir… entre otros? Lanzo la siguiente pregunta: ¿Nosotros no podríamos mandar todo ese dinero extra a los tarahumaras? No tendría porque haber problema, ¿cierto? Sin embargo aqui seguimos nosotros con nuestras comodidades, nuestra comida, nuestra educación, nuestros coches y casas, cuando son los misioneros CRISTIANOS, los que llevan no solo apoyo económico sino moral a estas comunidades de pobreza extrema.</p>\n<p>La raza humana, tiende a buscar una causa para todo, explicaciones lógicas que llenen ese vacío de comprensión sobre las cosas. Y algo que nosotros como humanos mexicanos nos encanta hacer es encontrar un chivo expiatorio para todos nuestras frustraciones y sentimientos de impotencia por la situación de nuestro país (sobre todo la económica). Es por eso que cuando se escucha que el Papa viene a México y que habrá un gasto fuerte, todo México se hace de palabras en contra de esto, por la idea de que pagar con impuestos mexicanos la visita de un líder religioso.</p>\n<p>Sin embargo, no olvidemos que también es representante de un estado, el Vaticano y que en anteriores ocasiones, cuando líderes políticos vienen a México, también han sido solventados los gastos por nada mas y nada menos que el mismo pueblo mexicano; Obama, Bush, Sarkozy, el mismo Fidel Castro… Y sin embargo ahí no se escuchan protestas, cuando estas visitas han costado no en precio similar a la de Benedicto XVI pero si alrededor de 30,000,000 por visita. Lo que me lleva al siguiente punto:</p>\n<p>La visita del Papa a Guanajuato tuvo un costo aproximado de 126mdp que es donde todos los protestantes brincan de sus sillas para alzar la voz. Sin embargo, no ven que el derrame económico provocado por los 3.4mdturistas alcanzo la cantidad de 524mdp, lo que cualquier persona con un poco de conocimiento básico de aritmetica reconoce como una clara situación de retorno de inversión y utilidad para el país.</p>\n<p>Sin embargo, no se detienen las cosas ahí, el incesante tema de Marcial Maciel, es algo que es tomado y abordado sin conocimiento alguno por las personas de las leyes internas de la Iglesia.</p>\n<p>La Iglesia como tal, posee un sistema de relgas internas llamado, Derecho Canónico, sistema separado por completo del sistema judicial del Estado (cosa con lo que en lo personal difiero enérgicamente y creo que debería aplicar igual). Sin embargo, se comenta mucho, que el Papa Juan Pablo II albergó y “encubrió” a Maciel, cuando lo que se aplicó en realidad fué una de las penas máximas del Derecho Canónico sobre Maciel; la reclusión, aislamiento y la revocación del sacerdocio. ¿Pero porque nadie se enteró? El encubrimiento como palabra significa ocultar algo cuando se es preguntado, sin embargo, no había nada que indicara al Papa a vociferar al mundo sobre los crimenes de Maciel. La ley de la Iglesia se aplicó y Maciel recibió el castigo. Pero nunca se encubrió. ¿Debería haber sido juzgado bajo la ley del estado? Probablemente. ¿El derecho canónico debería reformar estas áreas? Por supuesto! Pero en ningún momento se le pasaron por alto sus acciones.</p>\n<p>Son estos algunos datos y mas, bajo los que la Iglesia como institución se ha visto sometida a sobrellevar. Sin embargo, es importante que antes de abordar el barco de críticas e ira hacia la Iglesia o cualquier cosa, institución, candidato o empresa, se conozcan y se investiguen un poco mas que lo que postean en Facebook y en redes sociales. Recuerden que las noticias, son 100% manipulables y pueden o pueden no ser verdad en casos como estos.</p>\n<p>Como ciudadano les invito a que se informen antes de cualquier otra cosa y que separen los escándalos mediáticos de los verdaderos contenidos y temas, en este caso, el mensaje de Paz que tenía el Papa como misión en México.</p>\n<p>Por: Miguel Guadarrama</p>","fields":{"slug":"/enemigo-publico-no-1-la-iglesia-catolica/"},"frontmatter":{"title":"Enemigo público no. 1: La iglesia católica","date":"April 12, 2012","tags":["religion"]}}},"pageContext":{"slug":"/enemigo-publico-no-1-la-iglesia-catolica/","previous":{"fields":{"slug":"/debuguear-php-con-emacs-xdebug-y-geben/"},"frontmatter":{"title":"Debuguear php con emacs, xdebug y geben","aliases":[],"tags":["drupal","php"]}},"next":{"fields":{"slug":"/drupalcamp-panama-2012/"},"frontmatter":{"title":"DrupalCamp Panamá 2012","aliases":["drupalcamp-panam-2012"],"tags":["drupal"]}}}}