{"data":{"site":{"siteMetadata":{"title":"La gaceta de la cabeza","author":"Joaquín Bravo Contreras"}},"markdownRemark":{"id":"f54b28d7-9b07-5e06-9bbf-ecae375dda9b","excerpt":"Los votos matrimoniales son todo un rollo. Los tradicionales del rito normal de una boda la verdad son muy bonitos, salvo que por…","html":"<p>Los votos matrimoniales son todo un rollo. Los tradicionales del rito normal de una boda la verdad son muy bonitos, salvo que por tradicionales siempre ponen a la mujer en un papel, digamos, tradicional =).</p>\n<p>Liz y yo quisimos escribir nuestros propios votos, claro que con mucha inspiración y ayuda de los votos tradicionales y los que hay en Internet. Al final nos parece que quedaron bonitos. Y claro, siempre recordaremos el momento: <code class=\"language-text\">&quot;Yo, Lizbeth&quot;</code>.</p>\n<blockquote>\n<p><strong>Joaquin</strong>: En presencia de nuestros amigos y nuestra familia, yo, Joaquín Bravo Contreras, te prometo a tí Lizbeth Zavala Angulo, ser tu compañero, amigo y esposo fiel y amarte, chiquiarte y cuidarte todos los días de mi vida.</p>\n</blockquote>\n<blockquote>\n<p><strong>Liz</strong>: En presencia de Dios que seguramente está tomando nuestras manos. Yo, Lizbeth Zavala Angulo te prometo a tí Joaquín Bravo Contreras, ser tu compañera, amiga y esposa fiel, amarte respetarte y hacerte feliz todos los días de mi vida.</p>\n</blockquote>\n<blockquote>\n<p><strong>Liz</strong>: Coloco este anillo en tu dedo gigantesco para recordarte que al igual que esta circunferencia es infinita, así es mi amor y mi entrega  a ti. En el nombre del padre, del hijo, del Espíritu Santo y de María, Amén.</p>\n</blockquote>\n<blockquote>\n<p><strong>Joaquín</strong>: Coloco este anillo que es el complemento del mío en tu pequeño dedo para recordarte que tú eres mi complemento y media naranja, a quien amo y a quien me entrego eternamente. En el nombre del padre, del hijo y del Espíritu Santo, Amén.</p>\n</blockquote>\n<blockquote>\n<p><strong>Joaquin</strong>: Jesús dijo que donde está tu tesoro ahí estará también tu corazón, Liz, toma estas arras como recuerdo de que mi tesoro eres tú, así que con la confianza en Dios y el trabajo constante todo lo demás se nos dará por añadidura.</p>\n</blockquote>\n<blockquote>\n<p><strong>Liz</strong>: Joaquin, recibo estas arras como recuerdo de que nuestro tesoro es nuestro amor y con la confianza en Dios y un trabajo constante no nos faltará nada.</p>\n</blockquote>","frontmatter":{"title":"Los votos de Liz y Joaquín","date":"August 28, 2014"}}},"pageContext":{"slug":"/los-votos-de-liz-y-joaquin/","previous":{"fields":{"slug":"/setup-de-ambiente-de-desarrollo-ubuntu-debian/"},"frontmatter":{"title":"Setup de ambiente de desarrollo (ubuntu / debian)"}},"next":{"fields":{"slug":"/hello-world/"},"frontmatter":{"title":"Hello World"}}}}